function matchPhoneNumber(input) {
    
    //валиден телефонен номер:
    //започва с +359;
    //кода на областта - винаги 2;
    //номерът се състои от 7 цифри(разделени на две групи: 3 цифри и 4 цифри);
    //различните части са разделени с: интервал или тире;
    //добавя се граница на думата в края на съвпадението;
    //преди знака '+' има интервал или началото на низа.
    let pattern = /(?:\s|^)\+359(\s|-)2\1\d{3}\1\d{4}\b/g;
    let match = pattern.exec(input);
    let rez = [];

    while(match !== null) {

        rez.push(match[0].trim());

        match = pattern.exec(input);
    }
    console.log(rez.join(', '));
}

matchPhoneNumber(['+359 2 222 2222,359-2-222-2222, +359/2/222/2222, +359-2 222 2222 +359 2-222-2222, +359-2-222-222, +359-2-222-22222 +359-2-222-2222']);
matchPhoneNumber(['+359 2 357 3351 +359 2 22 2222 +359 2 173 3408 +359-2-789-2584 +359 2 193 3953 +359-2-961-0248 +359-2-789-2584 +359 2 222 222 +360 2 222 2222 +359 2 727 9740 +359-2-854-2280 +359 2 193 3953 +359 2 357 3351 +359 2 558 8560 +359 2 222 222']);